---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidNumberOfCircuitValueForSwitchPanel
source: html/b43b73b5-4036-d45c-39e7-93d818d8fb95.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidNumberOfCircuitValueForSwitchPanel Property

The number of circuits on the switchboard currently exceeds the value you entered. Reduce the number of circuits on the equipment before changing this value.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidNumberOfCircuitValueForSwitchPanel { get; }
```